var local_database = [
  {
    date: "Nov 18 2019",
    name: "分手感言",
    // 使用绝对路径，第一开始使用的是相对路径，但是两个页面都是用的这个模板，图片也是一样的，但是如果用相对路径必然会报错
    img: {
      authorImage: "/images/avatar/1.png",
      writerImage:
        "https://huixiong.oss-cn-beijing.aliyuncs.com/wgg/img (1).jpg"
    },
    writerContent:
      "我的好基友的分手感言，他没有给我说标题，不过下面这句话是他写的~",
    likeNum: "96",
    lookNum: "112",
    // ---新增
    author: "陈鹏",
    time: "刚刚",
    content:
      "为什么后来者居上，因为前者不争不抢，后者不知廉耻，当局者来者不拒。",
    writerId: 0,
    music: {
      musicUrl: "http://118.126.106.59/music/music116.mp3",
      title: "体面 - 于文文 ",
      imgSrc: "http://118.126.106.59/image/156891.jpg"
    }
  },
  {
    date: "Nov 18 2020",
    name: "比利·林恩的中场故事",
    img: {
      authorImage: "/images/avatar/2.png",
      writerImage:
        "https://huixiong.oss-cn-beijing.aliyuncs.com/wgg/img (2).jpg"
    },
    writerContent:
      "一 “李安是一位绝不会重复自己的导演，本片将极富原创性李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。",
    likeNum: "68",
    lookNum: "354",
    // ---新增
    author: "王泽乾",
    time: "两天前",
    content:
      "一 “李安是一位绝不会重复自己的导演，本片将极富原创性”李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。预告片首次曝光后，被视作是明年奥斯卡种子选手。该片根据同名畅销书改编。原著小说荣获美国国家图书奖。也被BBC评为21世纪最伟大的12本英文小说之一。影片讲述一位19岁德州男孩的比利·林恩入伍参加伊战，在一次交火中他大难不死，意外与战友成为大众的关注焦点，并被塑造成英雄。之后他们返回国内，在橄榄球赛中场休息时授勋。这名战争英雄却面临前所未有的心灵煎熬……李安为什么选中这部电影来拍？因为李安想要挑战前所未有的技术难题：以120帧每秒的速度、4K、3D技术全面结合，来掀起一场电影视觉革命。什么意思？所谓“电影是24格每秒的谎言”，其中的24格，就是帧数。",
    writerId: 1,
    music: {
      musicUrl: "http://118.126.106.59/music/music117.mp3",
      title: "戴羽彤 - 那女孩对我说",
      imgSrc: "http://118.126.106.59/image/156892.jpg"
    }
  },
  {
    date: "Nov 12 2016",
    name: "当我们在讨论经济学时，我们在讨论什么？",
    img: {
      authorImage: "/images/avatar/3.png",
      writerImage:
        "https://huixiong.oss-cn-beijing.aliyuncs.com/wgg/img (11).jpg"
    },
    writerContent:
      "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
    likeNum: "92",
    lookNum: "54",
    // ---新增
    author: "王泽坤",
    time: "三天前",
    content:
      "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",
    writerId: 2,
    music: {
      musicUrl: "http://118.126.106.59/music/music118.mp3",
      title: "王贰浪 - 像鱼 -",
      imgSrc: "http://118.126.106.59/image/156893.jpg"
    }
  },
  {
    date: "Nov 17 2016",
    name: "微信小程序开发指南",
    img: {
      authorImage: "/images/avatar/4.png",
      writerImage:
        "https://huixiong.oss-cn-beijing.aliyuncs.com/wgg/img (10).jpg"
    },
    writerContent:
      "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序",
    likeNum: "87",
    lookNum: "102",
    // ---新增
    author: "王美鑫",
    time: "两天",
    content:
      "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。反正，这一栏里的购物和游戏我是从来没点进去过的。以腾讯的尿性，小程序同服务号一样，其关系链及重要功能的开放程度会因“人”而异。对，优质的接口只会开放给腾讯的儿子们（滴滴呀、京东呀）",
    writerId: 3,
    music: {
      musicUrl: "http://118.126.106.59/music/music119.mp3",
      title: "纣王老胡 - 涩",
      imgSrc: "http://118.126.106.59/image/156894.jpg"
    }
  },
  {
    date: "Nov 25 2016",
    name: "爱奇艺创维开展战略合作，合力布局开放娱乐生态",
    img: {
      authorImage: "/images/avatar/5.png",
      writerImage:
        "https://huixiong.oss-cn-beijing.aliyuncs.com/wgg/img (4).jpg"
    },
    writerContent: "爱奇艺和创维分别作为国内领先的在线视频品牌",
    likeNum: "26",
    lookNum: "200",
    // ---新增
    author: "卢美琳",
    time: "24小时前",
    content:
      "爱奇艺和创维分别作为国内领先的在线视频品牌和家电品牌。双方一直锐意创新，为用户提供优质的服务体验和产品体验。据悉，爱奇艺与创维将展开从资本到VIP会员服务等各方面的深入合作。籍由此次合作，爱奇艺将战略投资创维旗下拥有高端互联网电视品牌的酷开公司。从下一财年开始，创维旗下互联网电视将通过银河互联网电视集成播控平台，预置VIP会员服务及相关内容。这种捆绑终端与VIP内容的全新销售模式，将大幅提升互联网电视终端用户的体验，给予用户更多优质内容的选择。",
    writerId: 4,
    music: {
      musicUrl: "http://118.126.106.59/music/music112.mp3",
      title: "隔壁老樊 - 这一生关于你的风景",
      imgSrc: "http://118.126.106.59/image/156895.jpg"
    }
  }
];
module.exports = {
  postList: local_database
};
